In [3]:
import pandas as pd
dados = pd.DataFrame([1, 1, 2, 3, 3, 3, 4, 4], columns = ['X'])

In [2]:
dados

   X
0  1
1  1
2  2
3  3
4  3
5  3
6  4
7  4

In [3]:
dados.drop_duplicates(inplace = True)

In [4]:
dados

   X
0  1
2  2
3  3
6  4

In [1]:
data = [1,2,3,4,5]

In [4]:
s = pd.Series(data)

In [5]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
index = ['Linha ' + str(i) for i in range(5)]
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [12]:
s = pd.Series(data, index)
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [18]:
data = {'Linha ' + str(i) : i + 1 for i in range(5)}
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [19]:
type(data)

dict

In [20]:
s = pd.Series(data)
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [21]:
s1 = s + 1

In [26]:
s2 = s + s1

In [27]:
s2

Linha 0     3
Linha 1     5
Linha 2     7
Linha 3     9
Linha 4    11
dtype: int64

In [28]:
data = [[1,2,3], [4,5,6], [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [29]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [30]:
index = ['Linha ' + str(i) for i in range(3)]
index

['Linha 0', 'Linha 1', 'Linha 2']

In [32]:
columns = ['Coluna ' + str(i) for i in range(3)]
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [34]:
df1 = pd.DataFrame(data, index, columns)
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [35]:
df1 = pd.DataFrame(data, index, columns = ['A', 'B', 'C'])
df1

         A  B  C
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [45]:
df1[df1 > 0] = 'A'
df1

         A  B  C
Linha 0  A  A  A
Linha 1  A  A  A
Linha 2  A  A  A

In [47]:
df2 = pd.DataFrame(data, index, columns = ['A', 'B', 'C'])
df2

         A  B  C
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [48]:
df2[df2 > 0] = 'B'
df2

         A  B  C
Linha 0  B  B  B
Linha 1  B  B  B
Linha 2  B  B  B

In [49]:
df1

         A  B  C
Linha 0  A  A  A
Linha 1  A  A  A
Linha 2  A  A  A

In [50]:
df2

         A  B  C
Linha 0  B  B  B
Linha 1  B  B  B
Linha 2  B  B  B

In [51]:
df3 = pd.concat([df1, df2])
df3

         A  B  C
Linha 0  A  A  A
Linha 1  A  A  A
Linha 2  A  A  A
Linha 0  B  B  B
Linha 1  B  B  B
Linha 2  B  B  B

In [54]:
df3 = pd.concat([df1, df2], axis = 1)
df3

         A  B  C  A  B  C
Linha 0  A  A  A  B  B  B
Linha 1  A  A  A  B  B  B
Linha 2  A  A  A  B  B  B

In [59]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4

In [1]:
import pandas as pd

numeros = [i for i in range(11)]
letras = [chr(i + 65) for i in range(11)]
nome_coluna = ['N']

df = pd.DataFrame(data = numeros, index = letras, columns = nome_coluna)

In [2]:
df

    N
A   0
B   1
C   2
D   3
E   4
F   5
G   6
H   7
I   8
J   9
K  10

In [6]:
chr(77)

'M'

In [ ]:
selecao = df['N'].isin([i for i in range(11) if i % 2 == 0])
df = df[selecao]
df

In [7]:
import pandas as pd

In [8]:
data = [[1,2,3], [4,5,6], [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [30]:
df = pd.DataFrame(data, list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [35]:
df.sort_index(inplace = True)
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [34]:
df.sort_values(by = ['X', 'Z'], inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [87]:
df_B = df_A.sort_values(by = ['Sexo', 'Nome'])

NameError: name 'df_A' is not defined

In [105]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'], index = index)

In [106]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
a     Ary     15    M    7.5      True
b   Cátia     27    F    2.5     False
c   Denis     56    M    5.0     False
d    Beto     32    M   10.0      True
e   Bruna     42    F    8.2      True
f    Dara     21    F    7.0      True
g  Carlos     19    M    6.0     False
h   Alice     35    F    5.6     False

In [107]:
selecao = (alunos['Aprovado'] == True) & (alunos['Sexo'] == 'F')
n1 = alunos[selecao]
n1

    Nome  Idade Sexo  Notas  Aprovado
e  Bruna     42    F    8.2      True
f   Dara     21    F    7.0      True

In [108]:
# idade entre 10 e 20 anos ou com idade maior ou igual a 40 anos
selecao = ((alunos.Idade >= 10) & (alunos.Idade <= 20)) | (alunos.Idade >= 40)
alunos[selecao]

     Nome  Idade Sexo  Notas  Aprovado
a     Ary     15    M    7.5      True
c   Denis     56    M    5.0     False
e   Bruna     42    F    8.2      True
g  Carlos     19    M    6.0     False

In [109]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
a     Ary     15    M    7.5      True
b   Cátia     27    F    2.5     False
c   Denis     56    M    5.0     False
d    Beto     32    M   10.0      True
e   Bruna     42    F    8.2      True
f    Dara     21    F    7.0      True
g  Carlos     19    M    6.0     False
h   Alice     35    F    5.6     False

In [110]:
alunos[['Idade', 'Sexo']]

   Idade Sexo
a     15    M
b     27    F
c     56    M
d     32    M
e     42    F
f     21    F
g     19    M
h     35    F

In [111]:
alunos[:]

     Nome  Idade Sexo  Notas  Aprovado
a     Ary     15    M    7.5      True
b   Cátia     27    F    2.5     False
c   Denis     56    M    5.0     False
d    Beto     32    M   10.0      True
e   Bruna     42    F    8.2      True
f    Dara     21    F    7.0      True
g  Carlos     19    M    6.0     False
h   Alice     35    F    5.6     False

In [112]:
alunos[6:][['Sexo', 'Notas']]

  Sexo  Notas
g    M    6.0
h    F    5.6

In [113]:
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
index

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

In [114]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
a     Ary     15    M    7.5      True
b   Cátia     27    F    2.5     False
c   Denis     56    M    5.0     False
d    Beto     32    M   10.0      True
e   Bruna     42    F    8.2      True
f    Dara     21    F    7.0      True
g  Carlos     19    M    6.0     False
h   Alice     35    F    5.6     False

In [120]:
alunos.loc[['d', 'f'], ['Notas']]

   Notas
d   10.0
f    7.0